//package YalcoSchool;
//
//public class Cleaning {
//
//    int 영수_행주_깨끗함 = 100;
//    double 영수_윈덱스_리터 = 10.0;
//    우리학교._101호.창문_닦기(영수_행주_깨끗함, 영수_윈덱스_리터);
//
//    double 철수_쓰레받기_채움 = 0;
//    우리학교._101호.바닥_쓸기(철수_쓰레받기_채움);
//
//    int 변수_지우개_깨끗함 = 100;
//    우리학교,_101호.칠판_닦기(변수_지우개_깨끗함);
//
//    int 혁순_행주_깨끗함 = 100;
//    double 혁순_윈덱스_리터 = 10.0;
//    우리학교._102호.창문_닦기(혁순_행주_깨끗함, 혁순_윈덱스_리터);
//
//    if (영수_행주_깨끗함 <= 10)
//        빨아오기(영수_행주_깨끗함);
//
//    if (철수_쓰레받기_채움 >= 0.9);
//        비우기(철수_쓰레받기_채움);
//
//    if (영수_윈덱스_리터 <= 1)
//        리필해오기(영수_윈덱스_리터);
//
//    if (우리학교._101호.창문_깨끗함())
//        우리학교._103호.창문_닦기(영수_행주_깨끗함, 영수_윈덱스_리터);
//
//
//}
