//package YalcoSchool;
//
//public class CleaningWithLoop {
//
//    int 영수_행주_깨끗함 = 100;
//    double 영수_윈덱스_리터 = 10.0;
//    while (!우리학교._101호_깨끗함()) {
//        if (영수_행주_깨끗함 <= 10)
//            빨아오기(영수_행주_깨끗함);
//        if (영수_윈덱스_리터 <= 1)
//            리필해오기(영수_윈덱스_리터);
//
//        우리학교._101호.창문_닦기(영수_행주_깨끗함, 영수_윙덱스_리터);
//    }
//
//    int 돌준_행주_깨끗함 = 100;
//    double 돌준_윈덱스_리터 = 10.0;
//    while (!우리학교._102호.창문_깨끗함()) {
//        if (돌준_행주_깨끗함 <= 10)
//            빨아오기(돌준_행주_깨끗함);
//        if (돌준_윈덱스_리터 <= 1)
//            리필해오기(돌준_윈덱스_리터);
//
//        우리학교._102호.창문_닦기(돌준_행주_깨끗함, 돌준_윈덱스_리터);
//    }
//
//    double 철권_쓰레받기_채움 = 0;
//    while (!우리학교._101호.바닥_깨끗함()) {
//        if (철권_쓰레받기_채움 >= 0.9)
//            비우기(철권_쓰레받기_채움);
//
//        우리학교._101호.바닥_쓸기(철권_쓰레받기_채움);
//    }
//
//}
