//package YalcoSchool.oop;
//
//import java.util.ArrayList;
//
//public class CleaningApp_v2 {
//    public static void main(String[] args) {
//
//        창문닦이_v2 영수 = new 창문닦이_v2(우리학교._101호);
//        바닥쓸이_v2 철권 = new 바닥쓸이_v2(우리학교._101호);
//        칠판닦이_v2 변수 = new 칠판닦이_v2(우리학교._101호);
//
//        영수.청소();
//        철권.청소();
//        변수.청소();
//
//        ArrayList<청소담당> 청소담당들 = new ArrayList<>();
//
//        청소담당들.add(new 창문닦이_v2(우리학교._102호));
//        청소담당들.add(new 창문닦이_v2(우리학교._103호));
//        청소담당들.add(new 창문닦이_v2(우리학교._104호));
//        청소담당들.add(new 창문닦이_v2(우리학교._105호));
//
//        청소담당들.add(new 바닥쓸이_v2(우리학교._102호));
//        청소담당들.add(new 바닥쓸이_v2(우리학교._103호));
//        청소담당들.add(new 바닥쓸이_v2(우리학교._104호));
//        청소담당들.add(new 바닥쓸이_v2(우리학교._105호));
//
//        청소담당들.add(new 칠판닦이_v2(우리학교._102호));
//        청소담당들.add(new 칠판닦이_v2(우리학교._103호));
//        청소담당들.add(new 칠판닦이_v2(우리학교._104호));
//        청소담당들.add(new 칠판닦이_v2(우리학교._105호));
//
//        for (청소담당 담당 : 청소담당들) {
//            담당.청소();
//        }
//
//
//    }
//}
